superadmin_add_admin = "Добавить админа"
superadmin_remove_admin = "Удалить админа"

configuration = "⚙️ Конфигурация"
feed = "Связь с общественностью"

admin_add_payer = "Добавить кассира"
admin_remove_payer = "Удалить кассира"

admin_add_operator = "Добавить оператора"
admin_remove_operator = "Удалить оператора"

admin_grab_accounts = "Акки на базу"
admin_put_kyc_statuses = "KYC'ы в Sheet"
admin_restart_failed_tasks = "Перезапуск тасок"
admin_stop_bot = "Остановить бота"

check = "Проверить"

confirm = "✅ Подтвердить"
cancel = "❌ Отменить"

accept = "✅ Готов"
decline = "❌ Пасую"

yes = "🤩 Все четко, подходит"
no = "😢 Железо не подходит"

done = "✅ Готово"
got_it = "😎 Интересно, го"

back = "◀️ Назад"

account = "👤 Мой аккаунт"
play = "🕹 Играть"
software = "💿 Установка"
go = "🚀 Погнали"
balance = "💰 Баланс"
leaderboard = "🏆 Лидерборд"
new_year_leaderboard = "🪙 Baza Tournament"
withdrawal = "💳 Вывод"
withdraw_all = "Вывести все"
referral = "💸 Реферальная программа"

start = "🚀 Запуск"

payer_withdraw_list = "💳 Список запросов"
payer_done = "✅ Отправлено"

check_ip = '🧐 Проверить'

more = '😎 Беру еще'
home = '↩️ Домой'

add_address = '💵 Добавить кошелек'
change_address = '💵 Сменить кошелек'

soft_done = '😎 Установил'

ok_go = '😎 Окей, го'

all_fine = '😋 Все четко'
red_proxy = '❌ Красный прокси'

closed = '❌ Закрыл'

exchange = '📈 Биржа'
wallet = '💰 Кошелек'

challenges = "Локации"
add_challenge = "Добавить"
edit_challenge = "Редактировать"
enable_challenge = "Включить"
disable_challenge = "Отключить"
change_priority_challenge = "Сменить приоритет"
time = "Время"
points = "Баллы"
youtube_link = "YouTube"
quest_info = "Инфа по квестам"
text = "Подсказка"
statistic = "Статистика"
refresh_accounts = "Обновить аккаунты"
find_afk = "Найти пидора"
punish_afk = "Наказать пидора"