superadmin_start = '''
Че намутим?
'''

superadmin_configuration = '''
Выбери какое поле конфигурации нужно изменить!
'''

superadmin_edit_configuration = '''
Ты выбрал поле {field} с текущим значением {value}!
Введи новое значение.
'''

internal_error = '''
Упсс, внутренняя ошибка бота🥲
'''

superadmin_config_updated = '''
Поле {field} обновлено со значением {value}!

Че намутим?
'''

superadmin_config_value_wrong = '''
Хммм, значение не соответствует формату поля {field} 🥲
Введи значение заново.
'''

superadmin_feed = '''
Сформируй сообщение, которое мы разошлем всем пользовательм:
'''

superadmin_feed_sent = '''
Сообщение разослал всем-всем-всем!
'''

superadmin_add = '''
Отправь контакт админа через телефон в бота и он будет иметь доступ к функционалу!
'''

superadmin_added = '''
Воувоу, поздравляю! Админ {name} добавлен!
'''

superadmin_add_exists = '''
Админ {name} уже добавлен!
'''

superadmin_added_error = '''
Необходимо добавить админа через телефонный контакт!
'''

superadmin_remove_empty = '''
Нет ни одного админа😐
Чтоб уволить нужно сначала кого-то нанять!
'''

superadmin_remove_confirm = '''
Уверен что хочешь удалить админа {username}?🤔
Он больше не сможет участвовать в процессе.
'''

superadmin_removed = '''
Админ {username} удален!
'''

superadmin_automation_error = '''
Произошла ошибка автоматизации!!!

Profile Name: {profile}

Host: {host}
Task Type: {task_type}
Task ID: {task_id}
Activity ID: {activity_id}
Error Message: {error}
'''


admin_grab_account_done = '''
Аккаунты успешно добавлены в базу!
'''

admin_restart_failed_list = '''
Пришли список профилей на перезапуск!
'''

admin_restart_failed_done = '''
Таски перезапущены!
'''

admin_start = '''
Йо, здарова! Кого наймем/уволим?
'''

admin_add = '''
Отправь контакт {contragent}а через телефон в бота и он будет иметь доступ к функционалу!
'''

admin_add_wrong = '''
Упс, не можем определить ID контакта телеграмм😐

Скорее всего номер записан в локальном формате, а необходимо его добавить в международном формате.
Или же контакт не зарегистрирован в телеграмм.

Исправь контакт и отправляй заново!
'''

admin_add_exists = '''
{contragent} {name} уже добавлен✌🏻
Или двойную ставку ему хочешь?!
'''

admin_added = '''
Поздравляю! {contragent} {name} добавлен!
'''

admin_added_error = '''
Необходимо добавить {contragent}а через телефонный контакт!
'''

admin_remove = '''
Выбирай кого убрать из рядов!
'''

admin_remove_empty = '''
Нет ни одного {contragent}а.
Чтоб кого-то уволить нужно сначала нанять!
'''

admin_remove_confirm = '''
Уверен что хочешь удалить {contragent}а {username}?🤔
Он больше не сможет участвовать в процессе.
'''

admin_remove_confirm_error = '''
Выбери из списка выше!
'''

admin_removed = '''
{contragent} {username} удален!
'''

admin_no_payer = '''
СРОЧНО!!!

Необходимо добавить кассира — нет ни одного кассира, а заявки уже летят!
'''

gamer_only_invite_access = '''
Доступ к боту – *только по приглашению\!*
Возьмите ссылку у того, кто Вас пригласил 🙃
'''

gamer_no_username = '''
Приветствуем в Shire Farm Bot — Вашем помощнике для участия в ивентах и получения наград\!

Чтобы начать играть и зарабатывать награды, необходимо установить псевдоним Username в настройках Телеграм\. 
Это обязательное требование для участия в ивентах\.

После того как настроите Username, возвращайтесь по реферальной ссылке 🙃

[*Инструкция по настройке Username*](https://telegra.ph/Kak-izmenit-Username-v-Telegram-imya-polzovatelya-v-TG-10-08)
'''

gamer_welcome = '''
Здесь Вы можете зарабатывать, играя в самые интересные блокчейн\-игры\.

А если Вы уже с нами — смело двигайтесь дальше и начинайте зарабатывать играя\! 🚀
'''

gamer_terms = '''
Все что Вам нужно \- это быть внимательным и следовать нашим инструкциям 👀 

Готовы начать? Тогда давай посмотрим на характеристики Вашего ПК 🖥
'''

gamer_terms_decline = '''
Это окончательное решение?
Подумайте еще раз и возвращайтесь\!
*Будем ждать Вас здесь 😜*
'''

gamer_requirements = '''
*Рекомендуемые характеристики ПК 🖥*

*ОС:* Windows 10 64\-бит
*Процессор:* Intel Core i5\-8400 или выше
*Оперативная память:* 8192 МБ \(8 ГБ\) или больше

*Видеокарта:* NVIDIA GeForce GTX 760 или выше

Однако *игра может работать и на более слабом ПК\.*
Поверьте в свой калькулятор – *просто попробуйте\!*

Идем дальше? 🤔
'''

gamer_requirements_fail = '''
Не узнаете, пока не попробуете\!
*Советуем проверить Ваш ПК* на практике 😉
Сделайте это *прямо сейчас\!*
'''

gamer_address = '''
*Пора выводить прибыль? 💸*

Чтобы получать честно заработанные деньги, Вам нужен *крипто\-кошелек в сети Polygon\.*

*Если он у Вас есть, в ответ на это сообщение напишите его адрес \(должно начинаться с 0x\)

Еще нет? Внимательно пройдите по всем шагам инструкции и создайте свой первый крипто кошелек 😎*


1️⃣ [«Как создать кошелек»](https://telegra.ph/Kak-sozdat-koshelek-MetaMask-10-08)
2️⃣ [«Как получить адрес Polygon»](https://telegra.ph/Kak-poluchit-adres-Polygon-10-08)
3️⃣ [«Как вывести деньги на карту»](https://telegra.ph/Kak-vyvesti-nagrady-na-kartu-10-08)
'''

gamer_address_wrong = '''
Похоже, *в адресе кошелька – ошибка 😞*
*Проверьте ее, исправьте* и следуйте дальнейшим инструкциям
'''

gamer_registration_completed = '''
Отлично 👏🏻 Теперь можете приступать к игре и заработку\!
'''

gamer_start = '''
Приветствуем в *главном меню игрового помошника Goldalf Guild*
Нажмите: 
*👤 Мой аккаунт* \- что бы проверить Ваш баланс и аккаунты
*🏆 Лидерборд* \- соревнуйтесь с другими гильдийцами
'''

gamer_referral_link = '''
Ваша уникальная ссылка\-приглашение ⤵️
{link}

*Просто скопируйте её и пришлите другу* 🙃
Когда Ваш друг зарегистрируется в боте и успешно пройдет *50 игр* SandBox, Вы получите *5 USDT* на свой кошелек 💵
'''

gamer_install = '''
Что бы начать играть,
*установите две программы:*

1️⃣ *Shire Farm Launcher для Windows* \(файл сверху\) 👆
2️⃣ [*Скачать Proxifier для Windows*](http://www.proxifier.com/download/ProxifierSetup.exe)

⚠️ *ВАЖНО* – запустите “Proxifier” после установки и введите любое имя и *лицензионный ключ* 🔑

*Лицензионный ключ “Proxifier”:*
`5JZ6S\-B3FKJ\-49YYP\-HCCQN\-3JVHX`
'''

gamer_fresh_install_launcher = '''
Что бы начать играть, скачайте и установи
*Shire Farm Launcher* для Windows \(файл сверху\) 👆
'''

gamer_fresh_install_proxifier = '''
Теперь скачайте и установите [Proxifier для Windows](http://www.proxifier.com/download/ProxifierSetup.exe)

⚠️ После установки запустите “Proxifier”,
введите любое имя и лицензионный ключ:

🔑 `5JZ6S\-B3FKJ\-49YYP\-HCCQN\-3JVHX`
'''

gamer_wait_jwt = '''
*Идет загрузка\! Нужно немного подождать 🙃*

Обычно это *происходит быстро*, но в *редких случаях* доходит до *15 минут* ⏱️

Можете пока пообщаться в чате с комьюнити, сделать зарядку или приготовь себе *чайку* 🍗
'''

gamer_challenge = '''
*{name}*

*Баллы за выполнение:* {points}
*Лимит времени:* {timeout}{quest_info}{premium_key_text}{hints}

{youtube_text}
'''

gamer_chest_challenge = '''
*{name}*

*Баллы за выполнение:* {points}
*Лимит времени:* {timeout}

*Сундуки в комнатах:*
{pass_list}

*Сундуки в теплицах:*
{land_list}

{youtube_text}
'''

gamer_another_challenge = '''
Подождите, *ищем другой аккаунт* для Вас\.\.\. 👀
'''

gamer_activity_timeout = '''
*Время прохождения игры исчерпано\.*
Извините, но мы вынуждены забрать этот аккаунт 😐

Не переживайте, у Вас есть еще 10 минут чтоб доделать задание и сдать аккаунт 😜
'''

gamer_cancel_account = '''
К сожалению, Вы не успели – время вышло\.

*Попробуете еще? 😉*
'''

gamer_unknown_error = '''
Какая то непонятная ошибка произошла... Перезапустите ссылочку еще разок!
'''

gamer_no_proxifier = '''
“Proxifier” так и не был установлен – *установите его*:

[*Скачать Proxifier для Windows*](http://www.proxifier.com/download/ProxifierSetup.exe)

⚠️ *ВАЖНО* – запустите “Proxifier” после установки и введите *лицензионный ключ* 🔑

*Лицензионный ключ “Proxifier”:*
`5JZ6S\-B3FKJ\-49YYP\-HCCQN\-3JVHX`
'''

gamer_proxifier_failed = '''
*Ооо нет\!*
Какая\-то ошибка с IP Вашего Proxifier 😟

*Похоже он не успел настроиться на успех \- нажмите 🚀 Запуск выше 😉*
'''

gamer_mac_failed = '''
*Ооо нет\!*
Не получилось установить MAC адрес\! Обратись к сапорту в чате\!
'''

gamer_fingerprint_red_proxy = '''
Вы уверены?
'''

gamer_fingerprint_red_proxy_confirm = '''
Отменяю аккаунт 😉

У Вас есть *10 минут* чтобы выгрузить данные\. 
'''

gamer_need_launch = '''
Похоже, что что Вы забыли установить игру\!

Загрузите *Sandbox Launcher* с сайта [Sandbox](https://sandbox.game/en/) после регистрации по кнопке *Download* в правом верхнем углу страницы\!
'''

gamer_run_upload = '''
Прежде чем продолжить, нужно обновить данные\!

*Нажмите на кнопку внизу* и все заработает само собой ⤵️
'''

gamer_launch = '''
Настраиваю конфигурацию на Вашем ПК. Подождите...
'''

gamer_launcher_expired = '''
Хмм... Похоже версия установленного лаунчера устарела... Давайте обновим?
'''

gamer_in_progress = '''
*Игра запущена\!* Если игра не запустилась, нажмите кнопку *Log In* в *Sandbox Launcher* и мы автоматически залогиним Вас\.
Удачи в прохождении квеста 🤞{social_appendix}

Чтоб запустить игру еще раз,
нажмите кнопку *◀️ Назад*\.
'''

gamer_social = '''
Вы молодец, но мне нужны доказательства\!
*Сделайте скриншот игры и загрузите его сюда 📸*
'''

gamer_social_wrong = '''
Нам нужна картинка, а не что попало\!
*Сделайте скриншот задания и загрузи его сюда 📸*
'''

gamer_same_photo = '''
Ну ты и хитрюга\! Но меня не проведешь 😑
*Этот скриншот уже использовался, поэтому выписываю Предупреждение\!*
'''

gamer_close_game_confirm = '''
Квест пройден полностью?
*Если выполнены не все задания, мы не засчитаем его*
'''

gamer_close_game = '''
*Закройте игру и Sandbox Launcher* в системном трее \(в нижней правой части экрана\), если это не сделал\!
'''

gamer_done = '''
Будем проверять качество исполнения\!
Сообщим, когда получим результаты\.

*А пока – возьми еще одно 😉*
'''

gamer_no_challenge = '''
Ваше стремление к игре – это нечто 🤩
*Но на данный момент нет ивентов или свободных аккаунтов\.*
*Возвращайтесь через полчаса*, что\-нибудь придумаем 😉
'''

gamer_activity_accepted = '''
Поздравляю Вас\! Все выполнено на "отлично" 🥳
*Держите \+{points}* за локацию {challenge_name}\!
'''

gamer_activity_played = '''
Благодарим за Вашу успешную игру, мы все еще собираем данные о баллах, скоро они добавятся на баланс Вашего аккаунта, а пока можете взять еще одну игру\!
'''

gamer_activity_declined = '''
Задача была пройдена не полностью\! Вы набрали всего {points} на локации {challenge_name}\.
*Если Вы считаете что что\-то пошло не так*, обратитесь к support в вашем чате комьюнити\.
'''

gamer_leaderboard = '''
Выберите лидерборд для просмотра:
'''

gamer_no_leaderboard = '''
Чтоб получить доступ к лидерборду необходимо *заработать баллы*
'''

gamer_account = '''
*Все о Вашем аккаунте:*

*Ваш реферал:* {referral}
*Ваши рефералы:* {referral_count}
*Адрес для выплат:* {address}

*Всего баллов:* {balance}

{accounts_table}
'''

gamer_change_address = '''
Введите новый адрес кошелька:
'''

gamer_twitter_failed = '''
Плохие новости: *Twitter забанил аккаунт*,
привязанный к Sandbox – задание обработать невозможно 😭
'''

gamer_contest_finished = '''
Плохие новости: *мы не можем начислить Вам баллы,
потому что ивент завершен* и обработать его теперь невозможно 😭
'''

gamer_ban = '''
К сожалению, *мы вынуждены забанить твой аккаунт 😱*

GAME OVER 👾
'''


gamer_call_feed = '''
Приветствуем🙋‍♂️ 

Давно не видели Вас в игре\! 
Самое время вернуться на поля сражений SandBox⚔️ 

*На данный момент активен самый прибыльный ивент за все время крипто игр с кругленькой суммой наград 💸*

Жмите кнопку *🕹 Играть* и присоединяйтесь к битве за SAND
'''


gamer_activity_feed = '''
Пссс… У нас есть незавершенные дела:

* • Вам доступно {count} игровых сессий для заработка\.*
_\(Эта информация должна быть строго между нами\! Не распространяйте ее\!\)

Зайдите, заработай горстку SAND\!💰_
'''

gamer_leave_feed = '''
💬 Ты был избран. Это сообщение получат не все, поэтому не обсуждай его в чатах.

На самом деле, наш чат BAZA известен команде Sandbox, и они тщательно его мониторят. Именно поэтому в последние недели было такое затишье. Мы даже заявили, что не будем участвовать в сезоне, но это был хитрый план. 😉

А теперь что происходит на самом деле:

🎯Builder’s Challenge: наши игры проходят модерацию, они не заблокированы. Сейчас более 100 игр на проверке. Sandbox уже сообщил, что выплаты за эти игры будут произведены отдельно, вне лидерборда. Так что жди вознаграждения.

🎯Конечно же, мы участвуем в Alpha Season 4 от Sandbox! Кто мы такие, если пропустим такой сочный ивент?

📊 10 млн песка, низкая конкуренция среди игровых гильдий, малое количество настоящих игроков и наша полная инфраструктура: софт, аккаунты, опыт и лучшие игроки в мире. Всё это делает участие в сезоне максимально выгодным.

Мы уже видели игры сезона и считаем, что на один аккаунт потребуется 1-2 часа времени. Если будет участвовать 250,000 аккаунтов, то заработок может составить 40 SAND на аккаунт или 20-40 SAND в час.

Наша схема остаётся прежней: 40% от доходов — твоя доля. То есть, до 16 SAND в час может быть твоим. Даже при текущем курсе это отличная прибыль. По нашей информации ближе к концу года будет рост цены песка, и награды станут ещё более привлекательными.

Если ты так же горишь энтузиазмом и готов завоевать Sandbox, переходи в наше обновленное комьюнити — Inside Guild твой статус в нем VIP. 

https://t.me/+y6GmsyeZ8rkxNDYy

Здесь ты будешь не только зарабатывать, но и получать инсайдерскую информацию о ходе сезона.
'''

gamers_goldalf_feed = '''
🔥 Только для своих. Держи в секрете. 🔥

Это сообщение получили только самые топовые и активные игроки. Если ты читаешь это – значит, мы тебя ценим и у нас для тебя особое предложение.

5-й Альфа Сезон пройдет в новой гильдии. Это закрытая информация, и о ней не должны знать все. Гильдия, в которой ты сейчас, никуда не исчезает, но основная движуха сезона будет именно там.

📌 Почему это важно?
✔️ Это даст тебе больше возможностей для наград и заработка.
✔️ Мы собираем только лучших для усиленной игры.
✔️ Всё сделано, чтобы максимально выжать из сезона профит.

⏳ Если ты с нами – переходи тихо и без лишних слов. Это наш маленький секрет. 🚀

🔗 Ссылка на новую гильдию: https://t.me/+F02x_Rc3LQRhYWZi
'''

gamers_player_feed = '''
*💸 Выплата SAND уже на подходе\!*

Деньги уже лежат на аккаунтах и ежедневно пополняются, в ожидании того момента, когда сезон закончится и начнётся распределение наград между игроками\. А до этого момента — всего 16 дней ⏳

🔥 Именно сейчас решается, кто заберёт больше всех\.Игроки, которые в прошлых сезонах заработали до $5000, вовсю проходят квесты, фармят очки и не теряют ни минуты\. Каждое их действие — это шаг ближе к выплатам\.

А ты?\.\.👀 Пропускаешь день, два… и тем самым добровольно отдаёшь свою долю награды другим\.Каждый упущенный день — это минус в твоём кошельке\.

Но\! Ты всё ещё можешь успеть\. Даже за 16 дней реально ворваться в топ и забрать солидный кусок\.

📌 Всё, что нужно — это зайти в игру сегодня\. Начать проходить квесты\. Фармить очки\. И просто не останавливаться\. К тому же сегодняшняя карта проходится за 1 минуту \(парни засекали\) и дает 26 баллов\.

🎯 SAND уже почти в твоём кармане\. Осталось только сделать шаг навстречу\.

Заходи прямо сейчас — и не отпускай своё\! 💥
'''


validator_start = '''
Здаров! Тут тебе будут прилетать инфа от пользователей — проверь что все верно задано, а после уже приступай к регистрации.
'''

validator_balance = '''
Всего заработано: {amount}

Уже снято: {withdrawal}
В процессе вывода: {withdrawing}

Остаток: {balance}
'''



user_balance = '''
Общий заработок: {total}

За регистрацию аккаунтов: {account}
По реферальной программе: {referral}

Всего снято: {withdrawal}
В процессе вывода: {withdrawing}

Остаток: {balance}
'''

user_withdrawal_balance = '''
Введи сумму вывода или нажимай «Вывести все»
ЗАПОМНИ! Есть только один запрос на вывод за сутки!
'''

user_withdrawal_balance_not_available = '''
Вывод средств недоступен, т.к. последний запрос был создан менее суток назад.
Вывод будет доступен {available_date}

Приходи завтра, мы все порешаем 😎
'''

user_withdrawal_balance_zero = '''
Упссс, нет доступных средств для вывода 🥲
Возвращайся как только что-то заработаешь!
'''

user_withdrawal_balance_confirm = '''
Сумма вывода: {amount}.
Номер карты: {card}

Подтвердить вывод?
'''

user_withdrawal_balance_card_exists = '''
Выбери карту, на которую капнет кэш 🤑
Можешь выбрать из списка или ввести новую:
'''

user_withdrawal_balance_card_new = '''
Введи свою карту:
'''

user_withdrawal_balance_card_incorrect = '''
Упсс, номер карты неверный 😉
Попробуй еще разок:
'''

user_withdrawal_balance_overflow = '''
Хммм, сумма превышает доступную сумму для вывода 🥲
Попробуй ввести заново или нажать «Вывести все»
'''

user_withdrawal_balance_not_digit = '''
Необходимо ввести сумму целым числом!
'''

user_withdrawal_balance_success = '''
Все прошло четко — запрос на вывод средств отправлен.
Ты получишь уведомление как только я отправлю бабос на твою карту✌🏻

Следующий вывод будет доступен {next_withdraw_date}
'''

new_withdraw_request = '''
Новый запрос на вывод!
Проверь список запросов.
'''

payer_start = '''
Привет! Тебе будут прилетать уведомления как только появится новый запрос на вывод средств.

Нажми на "💳 Список запросов" чтобы получить список актуальных запросов на вывод.
Обрабатывай запросы сверху вниз нажимая на кнопки по очереди и нажимай на кнопку "✅ Отправлено" как только сумма спишется с баланса карты.
'''

payer_list = '''
Выбирай запросы сверху вниз и обрабатывай:
'''

payer_list_no_requests = '''
Отличная работа 👏🏻Сейчас нет доступных запросов на вывод средств!
Ожидай уведомление о новом запросе!
'''

payer_process = '''
Сумма: {amount} грн
Карта: {card}

Нажми "✅ Отправлено" как только деньги спишутся.
'''

payer_done_proof = '''
Отправь квитанцию об оплате в бота!
'''

payer_done_proof_wrong = '''
Необходимо отправить квитанцию в бота PDF документом, не скриншотом или тем более текстом!
'''

payer_done = '''
Отлично🙌🏻
Продолжай в том же духе!
'''

notify_user_payment_done = '''
Запрос на вывод {amount} грн
на карту {card} обработан!
Чекни карту, бро 👊
'''

operator_statistic = '''
Количество игроков сейчас: {now_active_count}

Количество активных игроков (1 день): {day_active_count}
Количество активных игроков (7 дней): {week_active_count}
Количество активных игроков (30 дней): {month_active_count}

Количество игроков: {all_gamers}
Количество поигравших игроков: {all_played_gamers}
Количество успешно поигравших игроков: {all_success_played_gamers}

Количество баллов всего: {total_points}
Количество аккаунтов с баллами: {total_point_accounts}
Средний балл на аккаунте: {avg_points}

Всего песка заработано: {total_sand}
На аккаунтах: {total_sand_accounts}
Из них заклеймили: {total_sand_claimed}
Из них в ожидании клейма: {total_sand_pending_claim}

Всего аккаунтов с AP: {total_ap_accounts}
Забаненных аккаунтов: {total_banned_accounts}

Всего 10+ песка аккаунтов: {total_10_sand_accounts}
Всего 15+ песка аккаунтов: {total_15_sand_accounts}
Всего 20+ песка аккаунтов: {total_20_sand_accounts}
Всего 25+ песка аккаунтов: {total_25_sand_accounts}

Всего задач: {total_tasks_count}
Количество приоритетных задач: {priority_tasks_count}
Количество второстепенных задач: {secondary_tasks_count}

Активные WS серверы:
{active_servers}

Статистика по локациям:
'''

operator_referral_notification = '''
Игрок @{gamer} сделал {games} успешных игр.
Начислить его рефералу @{referral} ревард!
'''

operator_refresh_accounts = '''
Обновляю аккаунты... Это займет время...
'''

operator_refresh_accounts_done = '''
Свежая пачка добавлена
'''

operator_enter_account_name = '''
Введи полное точное имя аккаунта афкшника:
'''

operator_no_account_found = '''
Аккаунт не найден - проверь имя и введи еще раз!
'''

operator_enter_username = '''
Введи username афкшника:
'''

operator_afk_punished = '''
Игрок {username} наказан на {hours} часов!
'''

operator_no_gamer_found = '''
Игрок не найден - проверь имя и введи еще раз!
'''

operator_no_activities_found = '''
Игр на этом аккаунте не найдено!
'''